Revit 2024 API
ParameterTypeId.EnergyAnalysisPercentageSkylights Property
 "Target Percentage Skylights"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId EnergyAnalysisPercentageSkylights { get; }
Visual Basic
Public Shared ReadOnly Property EnergyAnalysisPercentageSkylights As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ EnergyAnalysisPercentageSkylights {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace